Autodesk.Revit.DB.ExternalService.IMultiServerServiceProxy.CanExecute(Autodesk.Revit.DB.ExternalService.IExternalServer,Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExternalService.IExternalData)
Implement this to test whether a particular server should be executed.
server:
An instance of a server that is to be tested.
document:
The associated document. It may be NULL if not applicable.
data:
The associated service data. It is the same data the Execute method would receive.
Since:
2013